Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver
The Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver class resolves the
face geometry out of the given toleration data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver.resolve
The delegate to call when the Resolve method gets executed.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver.viewData
The view data associated with the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver.#ctor(System.Func{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo,Tekla.BIM.Geometry.Face3},Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver class.
resolve: The delegate to call when the Resolve method gets executed.
viewData: The view data associated with the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedFaceResolver.Resolve(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace)
Resolves the face geometry out of the toleration data.
tolerationData: The toleration data to be used for resolving the geometry.
Returns: Resolved the face geometry.